# GroupCount Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
FabricationService..::..GroupCount Property
FabricationService Class See Also
---
This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `PaletteCount` property instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
[ObsoleteAttribute]
public int GroupCount { get; }
```

Visual Basic
---
```text
<ObsoleteAttribute> _
Public ReadOnly Property GroupCount As Integer
	Get
```

Visual C++
---
```text
[ObsoleteAttribute]
public:
property int GroupCount {
	int get ();
}
```

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace